20-rails-review/app/views/posts/new.html.erb

  <%= f.text_area :content %>
  <%= f.collection_select :blogger_id, Blogger.all, :id, :name%>
  <%= f.collection_select :destination_id, Destination.all, :id, :name%>
---
SELECT "bloggers".* FROM "bloggers"
SELECT "destinations".* FROM "destinations"