20-rails-review/app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "content", "blogger_id", "destination_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "asdasd"], ["content", "asdasd"], ["blogger_id", 1], ["destination_id", 1], ["created_at", "2018-09-27 14:49:04.787355"], ["updated_at", "2018-09-27 14:49:04.787355"]]
UPDATE "posts" SET "likes" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["likes", 0], ["updated_at", "2018-09-27 14:49:30.005375"], ["id", 40]]
---
  def create
    @post = Post.create(strong_params)
    @post.update(likes: 0)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 41], ["LIMIT", 1]]
UPDATE "posts" SET "likes" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["likes", 1], ["updated_at", "2018-09-27 15:02:40.234121"], ["id", 41]]
---
  def update_likes
    byebug
    @post = Post.find(params[:id])
    updated_likes = @post.likes + 1
    @post.update(likes: updated_likes)