16-intro-to-rails/playlister/app/controllers/songs_controller.rb

  def create
    @song = Song.new(song_params)

    respond_to do |format|
      if @song.save
---
INSERT INTO "songs" ("name", "artist_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Hello"], ["artist_id", 2], ["created_at", "2018-09-21 15:01:43.819192"], ["updated_at", "2018-09-21 15:01:43.819192"]]

  def update
    respond_to do |format|
      if @song.update(song_params)
---
UPDATE "songs" SET "name" = ?, "updated_at" = ? WHERE "songs"."id" = ?  [["name", "Happy"], ["updated_at", "2018-09-21 15:01:34.909921"], ["id", 1]]